import 'package:flutter/material.dart';

const kDuration = Duration(milliseconds: 300);
const kCurve = Curves.easeInToLinear;
const kSmapleText = '''
المقـدمة :
الحمد لله ، اللهّم لك الحمد كله ، ولك المُلكُ كلُه ، وبيدك الخيُر كلُه ، وإليك يُرجع الفضل كلُه ، علانيته وسـره ، فَأَهْلٌ أنت أن تُحمد ، إنك على كل شيءٍ قدير .
اللهّم ربنا لك الحمد بما خلقتنا ، ورزقتنا ، وهديتنا ، وعلَّمتنا ، وأنقذتنا ، وفرَّجْتَ عنا . لك الحمـد بالإيمان ، ولك الحمد بالإسلام ، ولك الحمد بالقرآن ، ولك الحمد ، بالأهل ، والمال ، والمعافاة ، فلك الحمد على ذلك حمداً كثيراً . لك الحمد بكل نعمة أنعمت بها علينا في قديم ، أو حديث ، أو سِرٍّ أو علانية ، لك الحمد حتى ترضى ، ولك الحمد إذا رضيت .
الحمدُ لله مجيب دعاء المضطرين ، وكاشف الضرّ عن البائسين ، كاشف الكُربات ، رب الأرض والسماوات ، الشافي فلا شفاءَ إلا شفاؤه ، الحمد لله الذي وَعَدَ من أطاعه جنات عدن تجري من تحتها الأنهار ، فيها ما لا عين رأت ، ولا أُذن سمعت ، ولا خطر على قلب بشر.
الحمدُ لله حمد الشاكرين ، وأدعوه أن يرحم أمة نبينا محمد ( ويرزقهم الصبر في الشدة ، حتى تقوى عزائمهم . ويرزقهم الصبر في الرخاء ، حتى يسلكوا طريق الله القويم ، فيشكروا خالقهم الذي آزرهم في الشدة والرخاء . وسبحان ربي القائل في محكم كتابه ( وَلَنَجْزِيَنَّ الَّذِينَ صَبَرُواْ أَجْرَهُم بِأَحْسَنِ مَا كَانُواْ يَعْمَلُونَ ( (1). والقائل : ( فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُواْ لِي وَلاَ تَكْفُرُونِ ( (2) .
وأُصلِّي وأسُلم على سيدنا محمد ( إمام الصابرين الشاكرين ، الذي تحمَّل أذى المشركين فنادى ربه بنداءِ اليقين والخوف من رب العالمين " اللهم إني أشكو إليك ضَعْفَ قُوَّتي ، وقِلَّة حيلتي ، وهواني على الناس ، يا أرحم الراحمين ، أنت رب المُسْتَضْعَفِين ، وأنت ربي ، إن لم يكن بك عليَّ غضبٌ فلا أُباليِ ...... " . الطبراني 
فعلى الرغم من الأذى الذي لَحِقَ بالرسول الكريم ( إلا أن الله كان شاغله الأول .
أما بعد :
فهذا كتاب : " آدَابُ الُدعَاءِ المُسْتجَابِ مِنَ السُنَّةِ والكِتَابِ " الذي طالما ما دَعَوْتُ الله أن يمدنى بعونه وتوفيقه حتى أتم هذا العمل ، فكانت الاستجابة الإلهية العظيمة . وكان هذا الكتاب المتواضع الذي بين يدي القارئ الكريم . وهو محاولة جادة وصادقة لإرشاد القارئ للأدعية المأثورة ، والدعوات المأخوذة من الكتاب والسنة ، قمت بجمعها ، وترتيبها ، وتنسيقها  ليسهل الانتفاع بها ، والإفادة منها . 
والحقيقة التي لا أستطيع أن أنكرها أنه عندما فكرتُ في الكتابة في هذا الموضوع ، أخذُتُ أُسائل نفسي ، هل أستطيع أن أكتب في آداب الدعاء من الكتاب والسُنَّة ؟ لأنني قبل ذلك كنت أكتب في الأدب والمكتبات ، ولي مؤلفات في ذلك . في بداية الأمر شعرتُ بصعوبة الخوض في آيات القرآن الكريم ، وأحاديث الرسول ( وبعظم ذلك الأمر على نفسي ، ثم قلتُ بعد تردد كثير دام شهوراً ، إنني سأُعالج الموضوع في كتابي من الناحية الموضوعية فقط ، وما أكثر من أقدم على هذا الموضوع قديماً وحديثاً .
لكن السبب الرئيس الذي دفعني لاختيار هذا الموضوع بالذات ، هو حلاوة العيش مع الدعاء القرآني والدعاء النبوي . ونحن في عصرنا الحاضر ، في أمس الحاجة إلى دعاءٍ يُستجابُ له حتى ينصرنا الله على أعدائنا .
حاولتُ قدْر جهدي في هذا الكتاب أن أجمع آيات الدعاء من القرآن الكريم ، وأَن أقف على صحيح الأدعية المأثورة عن النبي ( والأدعية المُستجابة الجامعة لخيري الدنيا والآخرة ، وأعيان الأذكار المُسْتحبة ، وأفضل الدعوات المباركات المُسْتحبات ، كما تناولت فيه آداب الدعـاء ، وفضـله ، وكيفيته ، ومواطن استجابته .... وغير ذلك من موضوعات أخرى .
ومن هنا فإن ما جاء في هذا الكتاب ، من أحاديث الرسول ( مأخوذة مما روى عن النبي ( ، أو مما جاء في كتاب الله تعالى من آيات الدعاء من القرآن الكريم . وقد أشرت إلى تخريج الأحاديث أو رقم الآيات القرآنية في سـورها من كتاب الله تعالى . وبذلك كنت دقيقاً في هذا الكتاب ، فالتزمتُ الأخْذَ من الكتاب والسنة التزاماً تاماً . وسرت على طريقة السلف الصالح ، ممن نفعهم الله بكتابه الكريم ، ونفعهم بالإقتداء برسوله الكريم ( وساروا على الطريق المستقيم ، لا يضل من اتبعه ، ولا يزيغ من سار على ضوئه .
هذه الدعوات القرآنية ، والأذكار المُصَفَّاة المختارة ، والأدعية النبوية المُنتخبة ، والتحصينات القرآنية ، والتسبيحات النبوية ، هي التي طالما دعا بها الأنبياء والرسل صلوات الله عليهم .كما دعا بها الزاهدون ، والصالحون ، والعلماءُ الصادقون المخلصون ، رضـوان الله عليهم ، فاسْتُجِيبت دعواتهم ، لأنهم كانوا لا يخافون أحداً في الدنيا إلا الواحد الأحد .
هذه الأدعية المأثورة من الكتاب والسنة ، هي خير زاد تطمئن بها القلوب ، لتصل إلى تقوى الله عزَّ وجـلَّ . وليس العبرة بجمع هذه الأدعية والأذكار ، وإنما العبرة بالعمل بما فيها ، وإلا كنا كما قال الشاعر (3) 
كاِلْعيسِ في البيداءِ يقتُلها الظَّما	*  والماءُ فوق ظهورها محمولُ 

لذلك ، فقد اقتضت خطة هذا الكتاب تقسيمه إلى بابين ، خصصت الباب الأول للحديث عن الدعاء ، فجاء في سبعة فصول : في الفصل الأول تحدثت عن آداب الدعاء ، وكان الفصل الثاني للحديث عن بركة الدعاء ، وجعلت الفصل الثالث للحديث عن مواطن استجابة الدعاء ، أما الفصل الرابع فدار حول الأدعية النبوية المأثورة ، وعالجت في الفصل الخامس أن الدعاء لا يرفعه إلا العمل الصالح . أما الفصل السادس فدار حـول فضـل الذكـر والتسبيح والتحميد والتهليل والتكبير والاستغفار .... ، وجاء الفصل السابع من هذا الباب حول فضل محبة الرسول والصلاة عليه .

أما الباب الثاني ، فكان حول القرآن العظيم ، فجاء الفصل الأول منه حول فضل القرآن الكريم ، واهتم الفصل الثاني بفضل قراءة القرآن الكريم ، ودار الفصل الثالث حول آيات الدعاء في القرآن الكريم ، أما الفصل الرابع فقد عالجتُ فيه التداوي بالقرآن الكريم والأدعية النبوية .

ولقد حاولت جاهداً ما استطعت أن أُكمل ما استشعرته نقصاً ، وأن أُضيف ما ارتأيته في حاجة إلى فضل وبيان . ولست أزعم أنني بلغت في ذلك ما أُريد ، أو أنني وفيتُ الموضوع حقه من الدراسة والتمحيص ، أو أدِّعي الكمال في عملي ، فالكمال لله وحده . ولكنني آمل أن تكون هذه المحاولة خطوة على الطريق . لأنني بذلتُ قُصارى جهدي في جمع مادة هذا الكتاب من مصادرها المختلفة .

وسوف أكون سعيداً بأي ملاحظة تُعين على تقويم هذا العمل وتسديده ، وإصلاح ما يكون قد داخله من نقصٍ أو خطأ أو تُسهم في البلوغ به حد الكمال .



''';